# 판다스(pandas)심화

## 데이터프레임 정렬

In [2]:
import numpy as np
import pandas as pd
print("DataFramde: ")
data = {
    'col1':[2,1,9,8,7,4],
    'col2':['A','A','B',np.nan,'D','C'],
    'col3':[0,1,9,4,2,3]
}
index = [1,3,2,5,0,4]
df = pd.DataFrame(data,index)
df

DataFramde:

   col1 col2  col3
1     2    A     0
3     1    A     1
2     9    B     9
5     8  NaN     4
0     7    D     2
4     4    C     3

In [10]:
# index axis=0(행)을 축으로, 내림차순
df = df.sort_index(axis=0, ascending=False)
df

   col3 col2  col1
5     4  NaN     8
4     3    C     4
3     1    A     1
2     9    B     9
1     0    A     2
0     2    D     7

In [9]:
# index axis=1(열)을 축으로, 내림차순
df = df.sort_index(axis=1, ascending=False)
df

   col3 col2  col1
5     4  NaN     8
4     3    C     4
3     1    A     1
2     9    B     9
1     0    A     2
0     2    D     7

In [12]:
# sort_value1
sorted_df1 = df.sort_values('col1',ascending=True)
sorted_df1

   col3 col2  col1
3     1    A     1
1     0    A     2
4     3    C     4
0     2    D     7
5     4  NaN     8
2     9    B     9

In [13]:
# sort_value 2
sorted_df2 = df.sort_values(['col2','col1'],ascending=[True,False])
sorted_df2

   col3 col2  col1
1     0    A     2
3     1    A     1
2     9    B     9
4     3    C     4
0     2    D     7
5     4  NaN     8

In [44]:
# 데이터 프레임의 index와 columns
import numpy as np
import pandas as ol
data = {
    'korea' : [50,60,70,30],
    'math' : [30,np.nan,40,20]

}
index = ['a', 'b', 'c','d']
df = pd.DataFrame(data,index=index)
print(df.index)
print (df.columns)
df

Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['korea', 'math'], dtype='object')

   korea  math
a     50  30.0
b     60   NaN
c     70  40.0
d     30  20.0

In [58]:
# count() 함수
print(df.count(axis=0)) # axis = 0 기본값(생략가능)
print(df.count(axis=1))

korea    4
math     4
dtype: int64
a    2
b    2
c    2
d    2
dtype: int64

In [59]:
# max(), min(), sum(), mean()
print(df.max())
print(df.max(axis=1))
print(df.min())
print(df.min(axis=1))
print(df.sum())
print(df.sum(axis=1))
print(df.mean())
print(df.mean(axis=1))
print(df.mean(axis=1,skipna=False)) # NaN값 보이게 하기

korea    70.0
math     40.0
dtype: float64
a    50.0
b    60.0
c    70.0
d    30.0
dtype: float64
korea    30.0
math     20.0
dtype: float64
a    30.0
b    30.0
c    40.0
d    20.0
dtype: float64
korea    210.0
math     120.0
dtype: float64
a     80.0
b     90.0
c    110.0
d     50.0
dtype: float64
korea    52.5
math     30.0
dtype: float64
a    40.0
b    45.0
c    55.0
d    25.0
dtype: float64
a    40.0
b    45.0
c    55.0
d    25.0
dtype: float64

In [61]:
# 결측값 대체 fillna
avg = df['math'].mean()
df['math']=df['math'].fillna(avg)
df

   korea  math
a     50  30.0
b     60  30.0
c     70  40.0
d     30  20.0

## 그룹으로 묶기 (groupby)

In [76]:
import numpy as np
import pandas as pd
df = pd.DataFrame({
    'key' : ['A','B','C','A','B','C'],
    'data1' : [1, 2, 3, 1, 2, 3],
    'data2' : [4, 4, 6, 0, 6, 1],
    # 'data3' : ['안녕','a','b','하세요','pple','3']
})
print("DataFrame:")
df

DataFrame:

  key  data1  data2
0   A      1      4
1   B      2      4
2   C      3      6
3   A      1      0
4   B      2      6
5   C      3      1

In [68]:
df.groupby('key').sum()

     data1  data2  data3
key
A        2      4  안녕하세요
B        4     10  apple
C        6      7     b3

In [75]:
df.groupby(['key','data1']).sum() # .reset_index()

           data2  data3
key data1
A   1          4  안녕하세요
B   2         10  apple
C   3          7     b3

In [78]:
df.groupby('key').aggregate(['min','median','max'])

    data1            data2
      min median max   min median max
key
A       1    1.0   1     0    2.0   4
B       2    2.0   2     4    5.0   6
C       3    3.0   3     1    3.5   6

In [79]:
df.groupby('key').aggregate({'data1':'max','data2':'sum'})

     data1  data2
key
A        1      4
B        2     10
C        3      7